src/Catalogs/ar_ПамятьАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_ПамятьАгента</Name>
			<Comment>Реестр записей долгосрочной памяти агента (index). META-25.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Агент</Name>
					<Comment>Агент, для которого сделана запись памяти.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ВладелецКлюч</Name>
					<Comment>Универсальный ключ владельца записи: agent:&lt;uuid ar_Агенты&gt; или ibuser:&lt;uuid ПользователяИБ&gt;. Заполняется параллельно с ar_Агент для обратной совместимости (MEM-03).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Текст</Name>
					<Comment>Короткая заметка/факт/правило.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Тип</Name>
					<Comment>Классификация записи: fact, preference, rule, note.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_КлючевыеСлова</Name>
					<Comment>Список ключевых слов/тегов через запятую для ускорения recall_memory.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Источник</Name>
					<Comment>manual - запись создана явно (remember/пользователь), auto - предложена регламентным заданием.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникRunId</Name>
					<Comment>UUID запуска, в ходе которого создана запись памяти.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Создано</Name>
					<Comment>Момент создания записи памяти.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Обновлено</Name>
					<Comment>Момент последнего изменения текста записи.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_ПамятьАгента/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Модуль объекта справочника ar_ПамятьАгента.
//
// Зона ответственности (META-25):
//   - автозаполнение ar_Создано и ar_Обновлено при создании/изменении;
//   - автозаполнение Наименования первыми символами ar_Текст.
//
// Справочник - реестр записей долгосрочной памяти агента (index).

#Область ОбработчикиСобытий

// Платформенный обработчик перед записью.
//
// Параметры:
//  Отказ - Булево - флаг отказа от записи.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Автозаполнение Наименования.
	Если ПустаяСтрока(Наименование) И ЗначениеЗаполнено(ar_Текст) Тогда
		Наименование = Лев(ar_Текст, 50);
	КонецЕсли;

	// Автозаполнение дат.
	Если ЭтоНовый() Тогда
		ar_Создано = ТекущаяДатаСеанса();
		ar_Обновлено = ТекущаяДатаСеанса();
	Иначе
		ОбъектБД = Ссылка.ПолучитьОбъект();
		Если ОбъектБД <> Неопределено И ОбъектБД.ar_Текст <> ar_Текст Тогда
			ar_Обновлено = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
